# Built In Failures Electrical Failures Mismatch Nmb Of Poles Assign Panel Property

Source: https://www.revitapidocs.com/2026/1c36e87f-c035-2348-7ce0-6060ce9e9232.htm

---

| Built In Failures Electrical Failures Mismatch Nmb Of Poles Assign Panel Property |
| --- |

Cannot assign \[Element] to Circuit. The Number of Poles for \[Element] does not match the Number of Poles (\[Name]) for the Circuit.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId MismatchNmbOfPolesAssignPanel { get; }
```

```
Public Shared ReadOnly Property MismatchNmbOfPolesAssignPanel As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ MismatchNmbOfPolesAssignPanel {
	FailureDefinitionId^ get ();
}
```

```
static member MismatchNmbOfPolesAssignPanel : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ElectricalFailures Class Autodesk.Revit.DB Namespace